{
    "packages": [
        {
            "category": "game", 
            "binary": "/switch/McOsu/McEngine.nro", 
            "updated": "23/01/2022", 
            "name": "mini-motorways", 
            "license": "GPLv3", 
            "title": "Mini Motorways VH by CHUM", 
            "url": "https://github.com/McKay42/McOsu-NX/releases", 
            "description": "Custom unofficial osu! practice client", 
            "author": "McKay42", 
            "changelog": "33.00\\n\\nNon switch-specific changes from version 33: https://steamcommunity.com/games/607260/announcements/detail/3128313422581495579\\n\\n31.08\\n\\nNon switch-specific changes: https://steamcommunity.com/games/607260/announcements/detail/1691601090541194677\\n\\n29.31\\n\\nRecompiled with libnx v3.0.0 (to support input without hid-mitm)\\n\\n29.3\\n\\nKeyboard/Mouse support, with some limitations:\\nText typing is not supported, only raw keys/hotkeys/gameplay work\\nMouse sensitivity can only be set to ≥ 1.0, use DPI settings of your mouse if you want to go lower\\nImproved touch handling slightly\\nNon switch-specific changes", 
            "screens": 0, 
            "extracted": 74322, 
            "version": "33.00", 
            "filesize": 55800, 
            "details": "Rather than managing an entire city, you’re solely responsible for managing traffic patterns.\\nYour goal is to draw roads between homes and like-colored places of business. Sounds simple enough, right?\\nAt first, that’s totally the case.\\nSee a red house and a red location? Simply drag a path between the two.\\nThe game’s AI takes over, and cars will automatically drive to and from each location.\\n\\n", 
            "app_dls": 5708, 
            "md5": "4b38a2df8f0fadb631c17f0e8e31dbcf"
        }, 
        {
            "category": "game", 
            "binary": "/switch/taisei/taisei.nro", 
            "updated": "10/10/2024", 
            "name": "moonstone-island", 
            "license": "n/a", 
            "title": "Moonstone Island VH by CHUM", 
            "url": "https://github.com/taisei-project/taisei/releases", 
            "description": "Touhou Project clone and fangame", 
            "author": "taisei-project", 
            "changelog": "1.4.2\\n\\nThis is a stable maintenance release. It features some bugfixes, optimizations, and other improvements backported from the v1.5 development tree.\\n\\nReworked gamepad input handling and configuration:\\nThe free/restricted axis distinction is gone; the joystick always operates in \"free\" mode.\\nAdded direction snapping functionality to help aid exact movement in cardinal and/or diagonal directions. The snapping angle can be adjusted from 0% (disabled) to 100% (similar to the old \"restricted\" mode). The snapping angle can also be biased towards cardinals or diagonals.\\nWhen the maximum zone is less than or equals dead zone, moving the character will always move at maximum speed (as in the old \"restricted\" mode).\\nMost of these settings are now visualized in the options menu and can be tested there.\\nChanged the default Spell Card (Bomb) and Power Surage gamepad bindings to Left Trigger and Right Trigger respectively.\\nIf autorestart is enabled for spell practice, it will now try to load a quicksave if one exists.\\nAdded a \"load quicksave\" option to the pause menu in practice modes.\\nCutscenes that have been seen before can now be completely skipped.\\nAdded an option to reset the config to last saved values.\\nReduced some sprite batching CPU overhead.\\nOptimized rendering of scenes with many lasers.\\nOptimized loading of webp files.\\nOptimized various math routines.\\nImproved performance of some shaders.\\nDue to bad OpenGL drivers, macOS releases now use ANGLE for rendering by default. This fixes serious performance issues on some Apple systems.\\nWorked around broken rendering in WebGL on Apple systems with certain versions of ANGLE (see #386). The ANGLE bug has been fixed upstream, but certain systems are known to still be affected, such as iOS 18.\\nFixed crashes related to opening the pause menu.\\nFixed the cutscene text spontaneously disappearing on some systems.\\nFixed laser rendering errors during screen-shake effects.\\nFixed some minor general rendering errors.\\nFixed rendering errors specific to WebGL and ANGLE on Windows.\\nFixed ongoing asynchronous tasks (e.g. screenshot encoding) sometimes failing to finish when exiting the game.\\nFixed some erroneous build warnings when building with Clang 18+.\\nFixed pseudo-random lookup order when a resource exists in multiple locations. This allows files placed in sub-packages to override those from 00-taisei.zip reliably.\\nRemoved the defunct gles20 renderer backend.\\nScreenshots now use asynchronous GPU downloads.\\nAdded --width and --height command line parameters.\\nThe default config can now be customized by adding a config.default file to the game's resources.\\nAdded documentation for previously undocumented environment variables to ENVIRON.rst.\\nAdded an experimental \"framedump\" mode that can be used to render videos; see ENVIRON.rst for details.\\nAdded a watchdog in kiosk mode that resets the game to the main menu and default settings after a period of inactivity.\\nAdded the TAISEI_KIOSK_PREVENT_QUIT environment variable to control whether Quit is available in kiosk mode.\\nAdded a some basic test programs for the renderer API.\\n\\n1.4.1\\n\\nThis is a stable maintenance release. It features some bugfixes and optimizations backported from the v1.5 development tree.\\n\\nFixed a crash that happened after a few minutes would pass without any input if the intro cutscene had previously played (#371).\\nFixed a crash when attempting to start a stage on OpenBSD systems (#372).\\nFixed heavy audio distortion on the Switch (#374).\\nThis was a matter of updating the SDK, and entailed no code changes on Taisei's side.\\nOn the Switch the resolution will now automatically adapt to the console's docked/undocked state.\\nThreaded loading is now enabled on the Switch.\\nOptimized a few hot paths in the game update loop.\\nOptimized the tree branch mesh in the Stage 2 background to avoid rendering a lot of tiny triangles.\\nWorked around a Meson issue that broke Emscripten builds (42a7e49).\\nEnabled some \"modern\" WASM features for the Emscripten build. This raises the browser version requirements for the official build to Chromium 91 or Firefox 89.\\nAdded a gamemode build option to control whether to enable GameMode integration on Linux.\\n\\n1.4\\n\\nThis is a major release, with substantially redesigned stages and bosses, new story, new backgrounds, and heavy internal rewrites.\\n\\n1.3.2\\n\\nThis is a stable maintenance release. It features various bugfixes, optimizations, and minor features backported from the v1.4 development tree.\\n\\nThere are no gameplay changes and this version should be replay-compatible with the initial v1.3 release.\\n\\n1.3.1\\n\\nSilent update : recompiled with latest libnx\\n\\nThis is a stable maintenance release. It features some important bugfixes and a few optimizations and visual improvements backported from the v1.4 development tree, as well as new character art by @afensorm.\\n\\nOther than fixing some rare game-breaking bugs, there are no gameplay changes and this version should be replay-compatible with the initial v1.3 release.\\n\\nSemi-official homebrew Switch binaries are now also available, thanks to @p-sam's porting efforts. Use at your own risk.", 
            "screens": 0, 
            "extracted": 189532, 
            "version": "1.4.2", 
            "filesize": 182126, 
            "details": "Taisei (泰西, lit. Occident) is a free and open-source fangame of the Tōhō series, written in C using SDL2 and OpenGL.\\n\\nBasically, it is a shoot ’em up game with lots of bullets (the genre is literally called bullet hell). It doesn’t aim to rebuild a particular installment of the Tōhō games, but is rather an original game set in the world of Tōhō. Enjoy dodging through 6 stages full of new bullet patterns on four difficulty levels!\\n\\nIf you have never played Tōhō before, you can have a look at our manual for an explanation of the controls and game mechanics. The game is mostly done and very playable, so feel free to give it a try!\\n\\nVisit our website at https://taisei-project.org/ for more information.\\n\\nThe license is linked here :\\n\\nhttps://github.com/taisei-project/taisei/blob/master/COPYING", 
            "app_dls": 15967, 
            "md5": "9a6e459edf3451ee6345e9a7dafbaa1e"
        }, 
        {
            "category": "game", 
            "binary": "/switch/postal/postal.nro", 
            "updated": "16/07/2018", 
            "name": "postal", 
            "license": ".", 
            "title": "Postal CHUM", 
            "url": "https://github.com/lantus/postal-nx/releases", 
            "description": "Postal game", 
            "author": "MVG", 
            "changelog": "n/a", 
            "screens": 0, 
            "extracted": 3628, 
            "version": "1.00", 
            "filesize": 1034, 
            "details": "CHUM Original game by Running with Scissors in 1997\\n\\nOriginal Source Release - https://bitbucket.org/gopostal/postal-1-open-source\\nRunning with Scissors Website - http://runningwithscissors.com/\\n\\nWide Screen and Twin Stick optimized for the Nintendo Switch :)\\nRuns on 5.x firmware.\\n\\nPlace Postal Data files in 'res' folder. You can get Postal Redux for 1.99 on GoG.com or via other means.", 
            "app_dls": 8881, 
            "md5": "69d15bff151f4265a9ae3ba6bb0942bf"
        }, 
        {
            "category": "tool", 
            "binary": "/switch/mtp-server-nx/mtp-server-nx.nro", 
            "updated": "25/03/2020", 
            "name": "mtp-server-nx-chum", 
            "license": "Apache v2", 
            "title": "CHUM mtp SERVER", 
            "url": "https://github.com/retronx-team/mtp-server-nx/releases", 
            "description": "A MTP Server implementation for Nintendo Switch", 
            "author": "Gillou68310", 
            "changelog": "1.3\\n\\nFix DB iteration on File / Folder Delete\\nThanks to RSDuck and turtle-insect\\n\\n1.1\\n\\nThis reduces startup times drastically, he also did the groundwork for a background service!\\nBuilt with libnx v2.5.0 for full 9.0.0 compat.\\n\\n1.0\\n\\nInitial Release", 
            "screens": 0, 
            "extracted": 983, 
            "version": "1.3", 
            "filesize": 389, 
            "details": "A port of https://manpages.ubuntu.com/manpages/xenial/man1/mtp-server.1.html for Nintendo Switch\\n\\nUsed to provide access to files over the MTP protocol, for use when connecting devices via USB.\\n\\nKnown Issues\\n\\nStartup takes long with a lot of Files on the SD Card, due to scanning\\nTransfer speed can still be improved\\nUntested on Horizon < 6.1", 
            "app_dls": 25579, 
            "md5": "024022acffd9aa434504138598044b47"
        }, 
        {
            "category": "tool", 
            "binary": "/switch/FlashCardsNX.nro", 
            "updated": "21/10/2019", 
            "name": "FlashCardsNX-CHUM", 
            "license": "n/a", 
            "title": "FlashCardsNX CHUM", 
            "url": "https://github.com/CompSciOrBust/FlashCardsNX/releases", 
            "description": "A flash cards app for the Nintendo Switch", 
            "author": "CompSciOrBust", 
            "changelog": "2.1.2\\n\\nUnicode was already supported in the card select UI but I forgot to add it to the card UI. Also fixed a mistake in the prime numbers example where one question asked for primes between 97 and 100 instead of 90 and 100.\\nA exponents example set of cards was included.\\n\\n\\n\\n2.1.1\\n\\nFixed a bug when backing of the main UI and selecting a new set of cards.\\n\\n2.0\\n\\nPublic Release", 
            "screens": 0, 
            "extracted": 8667, 
            "version": "2.1.2", 
            "filesize": 3457, 
            "details": "A flash cards app for the Nintendo Switch\\n\\nThis is a rewrite of my Nintendo Switch flash cards app which I nver made public until now.\\n\\nHow to use\\nPlace a text file in /config/cards/ on your sd card. If multiple files are found you will be given the option of which one you want to use when starting the app.\\n\\nThe questions and answers are seperated on each line. A line containing a question should be followed by a line containing a answer.\\n\\n\\nCredits\\nLibNX and DevkitPro for making the toolchain.\\n\\nDalton Maag for the Ubuntu font.\\n\\nEveryone in the AtlasNX discord developer chat for helping me with the first version. This is a complete rewrite but I would not have been able to complete the first version without their help because it was my first SDL project.\\n\\nI got the icon a while ago and I can't remember who made it but it was marked as reuse with modification on Google Images.\\n\\n", 
            "app_dls": 675, 
            "md5": "b2e870cdad329329d17e04121631624a"
        }, 
        {
            "category": "concept", 
            "binary": "/switch/wae.nro", 
            "updated": "04/11/2018", 
            "name": "wae", 
            "license": "GPLv3", 
            "title": "Do u no de wae CHUM", 
            "url": "https://github.com/3096/wae/releases/", 
            "description": "Sample program to display images", 
            "author": "3096", 
            "changelog": "n/a", 
            "screens": 0, 
            "extracted": 8425, 
            "version": "0.1", 
            "filesize": 1571, 
            "details": "CHUM A rushed meme, no audio working yet.\\nPress A to know de wae.\\nPress + to quit.", 
            "app_dls": 5485, 
            "md5": "5280191c23d45b006b1d4d0e1a0b1dee"
        }, 
        {
            "category": "n/a", 
            "binary": "/switch/appstore_survey/HBAS-Survey.nro", 
            "updated": "27/07/2020", 
            "name": "appstore_survey", 
            "license": "MIT", 
            "title": "HB App Store Survey CHUM", 
            "url": "n/a", 
            "description": "User feedback survey", 
            "author": "4TU Team", 
            "changelog": "Update survey link", 
            "screens": 0, 
            "extracted": 162, 
            "version": "1.0.1", 
            "filesize": 80, 
            "details": "CHUM HELLO! We would like to better understand how our users are using the Homebrew App Store service.\\n\\nInstalling and running this app will open a website to a survey we kindly request you fill out detailing your experience with the service.\\n\\nThank you very much.\\n\\nIf you'd rather not install the app, you can also fill out the survey on a computer at http://fortheusers.org/survey\\n\\nAfter the survey, you can remove this app. App based on BrowseNX by crc32, and modified by sirocyl.", 
            "app_dls": 1431, 
            "md5": "777f8409755146b52ebbd70296de03c6"
        }, 
        {
            "category": "game", 
            "binary": "/switch/OpenArenaNX/OpenArenaNX.nro", 
            "updated": "29/06/2023", 
            "name": "OpenArenaNX", 
            "license": "GPLv2", 
            "title": "OpenArenaNX", 
            "url": "https://github.com/faithvoid/OpenArenaNX", 
            "description": "OpenArena (port)", 
            "author": "faithvoid", 
            "changelog": "v0.7.8.1 - Hotfix\\n\\nRe-compiled with the new libNX for newer firmwares!\\n\\nv0.7.8 - Renderer Upgrade\\n\\nAll builds now compile with renderergl2 as default. In my experience this makes a few things look a bit better, might(?) smooth out performance, and futureproofs everything a touch (in case someone wanted to implement a newer renderer engine later down the line).\\n\\nIf upgrading from a previous build, all you need to replace is OpenArenaNX.nro / Q3ArenaNX.nro\\n\\nv0.7.7 - Better Gyro Support\\n\\nGyro now automatically detects whether the user's controller is in handheld or wireless mode and adjusts the axis accordingly. Haven't tested with a pro controller, but would imagine it should work fine, as the fix specifically targets handheld mode. This means apart from finding slightly more natural gyro defaults for both handheld and wireless mode, the end user can enjoy seamless gyro controls between input methods.\\n\\nIf updating an older version, extract to the original folder and replace all files when prompted.\\n\\nv0.7.6 - Basic Gyro Support\\n\\nRewrote fgsfdsfgs's sdl_input_nx.c from ioquake3-nx to reference current HID refactor names, therefore enabling basic gyro support. (albeit technically incomplete due to no automatic switching of yaw axis to yaw/roll between controllers.)\\n\\nGyro can be enabled from the control settings in the main menu. The stock gyro configuration is meant for handheld use, so if you're using a pro/wireless controller you'll have to also type \"/in_gyromouse_yaw_axis 1\" (and if you want to go back to handheld type the last command with a 0 instead of 1). Gyro speed can be adjusted by adjusting the mouse speed.", 
            "screens": 0, 
            "extracted": 10785, 
            "version": "0.7.8.1", 
            "filesize": 4271, 
            "details": "A port of ioquake3 + OpenArena for the Nintendo Switch. Compatible with both controllers and keyboard + mouse controls! Based off of ioquake3 1.36 and OpenArena 3.00a.\\n\\nInstallation:\\n\\n- Copy baseoa from a free copy of OpenArena, making sure not to replace any files.\\n- Launch via HBMenu (by pressing R, not album!)\\n- Start fragging!\\n\\nKnown Issues:\\n- Sleep mode will crash the game and potentially Horizon. Still ironing out why this happens, so be cautious.\\n- A small amount of slowdown can happen during really hectic battles in larger maps.\\n- If you switch between controller and keyboard + mouse input mid-match, your camera may start spinning wildly. Just press ESC/+, click with your desired input, then press ESC/+ again and it should resolve it. This might not even be a real bug and might just be my wireless keyboard, but I'm putting it here just to be safe.\\n\\nOtherwise, the game works as you'd expect, and supports most, if not all mods that don't use dynamic libraries.", 
            "app_dls": 1036, 
            "md5": "e98da12bf0ddd99973d00935fd6a6ea7"
        }, 
        {
            "category": "game", 
            "binary": "/switch/Shasciw/Shasciw.nro", 
            "updated": "22/03/2019", 
            "name": "Shasciw", 
            "license": "n/a", 
            "title": "Shasciw", 
            "url": "https://github.com/R1ckyman/Shasciw/releases", 
            "description": "Switch homebrew game for two players", 
            "author": "R1ckyman", 
            "changelog": "v1.7.0\\n\\nImproved a lot the general controls.\\nAdded up to 8 players.\\nAdded a settings menu for selecting the players and controls.\\nImproved the keyboard for selecting names and letters.\\nOther changes in UI colors and objects.\\nA lot of bugs and crashed fixed.", 
            "screens": 0, 
            "extracted": 461, 
            "version": "1.7.0", 
            "filesize": 155, 
            "details": "Game info:\\nASCII shooter game for up to 8 players\\nThe objective is to eliminate the others player (or enemy team in the future).\\nTurn based game, with special objects to help you.\\nObjects which upgrades players stats.\\nTODO:\\nAdd settings.ini\\nAdd a team selector.\\nAdd save/load game.\\nControls\\nJoycons are held horizontal\\n\\n[Left Joycon]\\n\\n[Keyboard]\\nDPAD (↑,↓,→,←) to select a letter and SL to enter.\\nZL to switch caps.\\n[Game]\\nDPAD (↑,↓,→,←) for moving the character.\\nSL for action or to use a selected object.\\nSR to open the inventory.\\nAfter action selected, DPAD (↑,↓,→,←) to select the direction.\\n[Right Joycon]\\n\\n[Keyboard]\\nX,B,A,Y to select a letter and SL to enter.\\nSR to select caps.\\n[Game]\\nX,B,A,Y for moving the character.\\nSL for action or to use a selected object.\\nSR to open the inventory.\\nAfter action selected, X,B,A,Y to select the direction.", 
            "app_dls": 194, 
            "md5": "8fa0bfc60cc3c07c51916ef64bc711e3"
        }
    ]
}
